#+title: 1431. Kids With the Greatest Number of Candies
#+author: nshan651
#+startup: inlineimages

https://leetcode.com/problems/kids-with-the-greatest-number-of-candies/

There are n kids with candies. You are given an integer array candies, where each candies[i] represents the number of candies the ith kid has, and an integer extraCandies, denoting the number of extra candies that you have.

Return a boolean array result of length n, where result[i] is true if, after giving the ith kid all the extraCandies, they will have the greatest number of candies among all the kids, or false otherwise.

Note that multiple kids can have the greatest number of candies.

* Examples
** Example 1:
#+begin_example
Input: candies = [2,3,5,1,3], extraCandies = 3
Output: [true,true,true,false,true]
Explanation: If you give all extraCandies to:
- Kid 1, they will have 2 + 3 = 5 candies, which is the greatest among the kids.
- Kid 2, they will have 3 + 3 = 6 candies, which is the greatest among the kids.
- Kid 3, they will have 5 + 3 = 8 candies, which is the greatest among the kids.
- Kid 4, they will have 1 + 3 = 4 candies, which is not the greatest among the kids.
- Kid 5, they will have 3 + 3 = 6 candies, which is the greatest among the kids.
#+end_example

** Example 2:
#+begin_example
Input: candies = [4,2,1,1,2], extraCandies = 1
Output: [true,false,false,false,false]
Explanation: There is only 1 extra candy.
Kid 1 will always have the greatest number of candies, even if a different kid is given the extra candy.
#+end_example

** Example 3:
#+begin_example
Input: candies = [12,1,12], extraCandies = 10
Output: [true,false,true]
#+end_example

* Constraints:
    - n == candies.length
    - 2 <= n <= 100
    - 1 <= candies[i] <= 100
    - 1 <= extraCandies <= 50

* Solution

#+begin_src C++ :includes <iostream> :flags -I./src/util -std=c++20 :tangle src/1431-kids-with-the-greatest-number-of-candies.cpp
  #include <vector>
  #include <algorithm>

  class Solution {
  public:
    std::vector<bool> kidsWithCandies(std::vector<int>& candies, int extraCandies) {
      std::vector<bool> result;
      // Max element returns an iter from [foundPos, endPos]
      // Dereference this to get the actual max value
      int mostCandies = *std::max_element(candies.begin(), candies.end());

      std::transform(candies.begin(), candies.end(), std::back_inserter(result),
                     [&](int i) { return (i + extraCandies) >= mostCandies; });

      return result;
    }

  };
  int main()
  {
    Solution s1;

    // [2,3,5,1,3]
    // 3
    std::vector<int> candies = {2, 3, 5, 1, 3};
    int extraCandies = 3;

    std::vector<bool> res = s1.kidsWithCandies(candies, extraCandies);

    for (bool b : res)
      std::cout << b << std::endl;
  }
#+end_src

#+RESULTS:
| 1 |
| 1 |
| 1 |
| 0 |
| 1 |
